app/Http/Controllers/ApiController.php

    public function buyNow(Request $request)
    {
        $validator = Validator::make($request->only('user_id', 'transaction_id', 'item_id', 'item_type', 'item_price', 'payment_status'), [
            'user_id' => 'required',
            'transaction_id' => 'required',
            'item_id' => 'required',
            'item_type' => 'required',
            'item_price' => 'required',
            'payment_status' => 'required'
        ]);

        if ($validator->fails()) {
            return response()->json(['success'=>false,'message' => $validator->messages()->first()], 200);
        }
        $response = [];
        $transaction = new Transaction;
        $transaction->user_id           = $request->user_id;
        $transaction->transaction_id    = $request->transaction_id;
        $transaction->item_id           = $request->item_id;
        $transaction->item_type         = $request->item_type;
        $transaction->item_price        = $request->item_price;
        $transaction->status        = 1;
        $transaction->payment_status    = $request->payment_status;
        $transaction->save();
---
insert into `transactions` (`user_id`, `transaction_id`, `item_id`, `item_type`, `item_price`, `status`, `payment_status`, `updated_at`, `created_at`) values (24, '787554adsf1212hghd2757', 1, 1, 192, 1, 'success', '2022-11-23 12:42:08', '2022-11-23 12:42:08')