app/Http/Controllers/HomeController.php

select count(*) as aggregate from `users` where `role` = 1
select `id`, `image`, `book_name`, `exam_id`, `selling_price` from `books` order by `id` desc limit 5
select `id`, `name`, `email`, `phone` from `users` where `role` = 1 order by `id` desc limit 5
---
    public function index()
    {
        /*if (! config('app.ordering')) {
            if (auth()->user()->hasRole('owner')) {
                return redirect()->route('admin.restaurants.edit', auth()->user()->restorant->id);
            } elseif (auth()->user()->hasRole('admin')) {
                return redirect()->route('admin.restaurants.index');
            }
        }*/
        $months = [
            0 => __('Jan'),
            1 => __('Feb'),
            2 => __('Mar'),
            3 => __('Apr'),
            4 => __('May'),
            5 => __('Jun'),
            6 => __('Jul'),
            7 => __('Aug'),
            8 => __('Sep'),
            9 => __('Oct'),
            10 => __('Nov'),
            11 => __('Dec'),
        ];

        $totalExam = Exam::count();
        $totalCoaching = Coaching::count();
        $totalBook = Book::count();
        $totalUsers = User::where('role', 1)->count();
        $booksListDashboard = Book::select('id', 'image', 'book_name', 'exam_id', 'selling_price')->orderBy('id', 'desc')->take(5)->get();
        $userListDashboard = User::select('id', 'name', 'email', 'phone')->where('role', 1)->orderBy('id', 'desc')->take(5)->get();

select `client_id` from `orders` group by `client_id`
---
                $last30daysOrders = Order::all()->where('created_at', '>', $last30days)->count();
                $last30daysOrdersValue = Order::all()->where('created_at', '>', $last30days)->where('payment_status','paid')->sum('order_price');
                //$uniqueUsersOrders = Order::all()->unique('address_id')->count();
                $uniqueUsersOrders = Order::select('client_id')->groupBy('client_id')->get()->count();

select SUM(order_price + delivery_price) AS sumValue from `orders` where `created_at` > '2022-05-01 00:00:00' and `payment_status` = 'paid' group by YEAR(created_at), MONTH(created_at) order by YEAR(created_at), MONTH(created_at) asc
select MONTH(created_at) as month from `orders` where `created_at` > '2022-05-01 00:00:00' and `payment_status` = 'paid' group by YEAR(created_at), MONTH(created_at) order by YEAR(created_at), MONTH(created_at) asc
select count(id) as totalPerMonth from `orders` where `created_at` > '2022-05-01 00:00:00' and `payment_status` = 'paid' group by YEAR(created_at), MONTH(created_at) order by YEAR(created_at), MONTH(created_at) asc
---

                //Last 7 months sales values
                $sevenMonthsDate = Carbon::now()->subMonths(6)->startOfMonth();
                $salesValue = DB::table('orders')
                            ->select(DB::raw('SUM(order_price + delivery_price) AS sumValue'))
                            ->where('created_at', '>', $sevenMonthsDate)
                            ->where('payment_status','paid')
                            ->groupBy(DB::raw('YEAR(created_at), MONTH(created_at)'))
                            ->orderBy(DB::raw('YEAR(created_at), MONTH(created_at)'), 'asc')
                            ->pluck('sumValue');

                $monthLabels = DB::table('orders')
                            ->select(DB::raw('MONTH(created_at) as month'))
                            ->where('created_at', '>', $sevenMonthsDate)
                            ->where('payment_status','paid')
                            ->groupBy(DB::raw('YEAR(created_at), MONTH(created_at)'))
                            ->orderBy(DB::raw('YEAR(created_at), MONTH(created_at)'), 'asc')
                            ->pluck('month');

                $totalOrders = DB::table('orders')
                            ->select(DB::raw('count(id) as totalPerMonth'))
                            ->where('created_at', '>', $sevenMonthsDate)
                            ->where('payment_status','paid')
                            ->groupBy(DB::raw('YEAR(created_at), MONTH(created_at)'))
                            ->orderBy(DB::raw('YEAR(created_at), MONTH(created_at)'), 'asc')
                            ->pluck('totalPerMonth');

select SUM(delivery_price + static_fee + fee_value) AS sumValue from `orders` where `created_at` > '2022-10-24 13:01:47' and `payment_status` = 'paid' limit 1
---
                $last30daysDeliveryFee = Order::all()->where('created_at', '>', $last30days)->where('payment_status','paid')->sum('delivery_price');
                $last30daysStaticFee = Order::all()->where('created_at', '>', $last30days)->where('payment_status','paid')->sum('static_fee');
                $last30daysDynamicFee = Order::all()->where('created_at', '>', $last30days)->where('payment_status','paid')->sum('fee_value');
                $last30daysTotalFee = DB::table('orders')
                                    ->select(DB::raw('SUM(delivery_price + static_fee + fee_value) AS sumValue'))
                                    ->where('created_at', '>', $last30days)
                                    ->where('payment_status','paid')
                                    ->value('sumValue');

select * from `orders`
---
                //dd(Carbon::now()->format('M'));
                $views = Restorant::sum('views');

                return view('dashboard', [
                    'totalUsers' => $totalUsers,
                    'totalExam' => $totalExam,
                    'totalCoaching' => $totalCoaching,
                    'totalBook' => $totalBook,
                    'userListDashboard' => $userListDashboard,
                    'booksListDashboard' => $booksListDashboard,
                    'last30daysOrders'=> $last30daysOrders,
                    'last30daysOrdersValue'=> $last30daysOrdersValue,
                    'uniqueUsersOrders' => $uniqueUsersOrders,
                    'allClients' => $allClients,
                    'allViews' => $views,
                    'salesValue' => $salesValue,
                    'monthLabels' => $monthLabels,
                    'totalOrders' => $totalOrders,
                    'countItems'=>Restorant::count(),
                    'last30daysDeliveryFee' => $last30daysDeliveryFee,
                    'last30daysStaticFee' => $last30daysStaticFee,
                    'last30daysDynamicFee' => $last30daysDynamicFee,
                    'last30daysTotalFee' => $last30daysTotalFee,
                    'months' => $months,