app/Http/Controllers/UserController.php

    public function index(User $model)
    {
        return view('users.index', ['users' => User::where('role', 1)->orderBy('id', 'desc')->get()]);
---
select * from `users` where `role` = 1 order by `id` desc